{"pageProps":{"page":{"title":"Что такое PWA","tag":"technology pwa web","description":"PWA или же Progressive web apps - это веб-приложения, использующие современные api, предоставляемые браузерами, для создания кроссплатформенного приложения, всё также работающего в изолированной среде браузера, однако имеющие больше возможностей по сравнению с обычными сайтами","slug":"pwa","link":"chto-takoe-pwa","global":{"comments":"Обязательно оставь свой комментарий и не забудь добавить в закладки чтобы не потерять)","forget":"Добавь в закладки, чтобы всегда иметь под рукой)","article":"Статья","tool":"О программе","min":"мин."},"job":"articles","content":"## PWA\r\n**PWA** или же **Progressive web apps** - это веб-приложения, использующие современные api, предоставляемые браузерами, для создания кроссплатформенного приложения, всё также работающего в изолированной среде браузера, однако имеющие больше возможностей по сравнению с обычными сайтами.\r\n\r\n## Достоинства PWA\r\nПрогрессивные веб-приложения получили большое преимущество над обычными сайтами и в то же время легко сравнялись с нативными приложениями:\r\n* PWA-приложения проще и дешевле создавать, чем их нативные версии. Разработка веб-приложения легче, так как нет необходимости писать отдельное приложение под каждую операционную систему и тратить на это огромные ресурсы. Веб-приложение может работать на любой операционной системе, любой браузер.\r\n* PWA-приложения могут работать в режиме оффлайн. Пользователи всегда смогут воспользоваться приложением, особенно это важно для тех, у кого нестабильное или слабое соединение, например пользователям, находящимся в метро или загородом.\r\n* Прогрессивные приложения поддерживают Push уведомления, что позволяет им конкурировать наравне с их нативными версиями.\r\n## Недостатки PWA\r\nНесмотря на огромные достоинства, ни одна технология не обойдётся без недостатков: \r\n* Низкая поддержка браузерами. Технология считается достаточно новой и неустоявшейся из-за чего многие браузеры её внедряют крайне неохотно. Однако процесс медленно и уверенно идёт, а разработчикам остаётся наблюдать как люди чаще используют PWA-приложения в своей жизни.\r\n\r\n\r\n## Требования для PWA\r\nДля того, чтобы веб-приложение считалось прогрессивным, оно должно соответствовать определённым требованиям:\r\n1. Наличие файла **Manifest**. Данный файл содержит важные сведения, используемые браузером для определения приложения как PWA и для его установки по настройкам, содержащимся в этом файле. Манифест включает информацию о названии, тематике, описании веб-приложения, наличие его настольной версии, формат отображения и многое других.\r\n2. Https соединение. Важное значение в современном Интернете отводится Безопасности. Незащищённое соединение может быть прочитано посторонними лицами, что ставит под удар надёжность передаваемой между пользователем и сервером информации. Из этого зародилось требование к обязательной поддержке защищённого соединения для прогрессивных веб-приложений. Это отностится в том числе и к технологии WebSocket. \r\n3. Должен использовать технологию Service Workers. Воркеры позволяют работать приложению в режиме офлайн, предварительно кэшируя необходимые для работы приложения файлы. Также они способны определять текущее состояние сети и в зависимости от этого выдавать определённый контент.\r\n\r\n## Действительно ли нужен PWA?\r\n\r\nPWA-приложения всё больше приходят в веб, заменяя неразвивающиеся сайты давних времён. PWA ещё не так прочно вошёл в жизнь пользователей Интернета, однако появляются всё новые и закрепляются недавно появившиеся технологии. \r\n\r\nДействительно, не каждый сайт должен представлять из себя PWA, однако проектам, нацеленым на работу с большой аудиторией, следует присмотреться к данному набору web-технологий.  "},"links":{"tools":[{"title":"Калькулятор онлайн - Удобный и Точный","link":"calkylyator","slug":"calc","image":"tools/calc.svg","short":"Калькулятор"},{"title":"Онлайн Секундомер - Точный и Простой","link":"secundomer","slug":"stopwatch","image":"tools/stopwatch.svg","short":"Секундомер"},{"title":"Будильник Онлайн - Простой, Удобный и Бесплатный Будильник","link":"budilnik","slug":"alarm","image":"tools/alarm.svg","short":"Будильник"},{"title":"Таймер Онлайн - Простой, Удобный и Бесплатный Таймер","link":"tajmer","slug":"timer","image":"tools/timer.svg","short":"Таймер"},{"title":"Онлайн Блокнот - Удобный и Лёгкий","link":"bloknot","slug":"notebook","image":"tools/notebook.svg","short":"Блокнот"},{"title":"Онлайн чат с передачей файлов","link":"chat","slug":"transfer","image":"tools/transfer.svg","short":"Передача данных"}],"footer":[{"short":"Пользовательское соглашение","link":"terms"}],"articles":[{"title":"Что такое регулярные выражения","link":"chto-takoe-regulyarnye-vyrazheniya"},{"title":"Как повысить эффективность работы за компьютером?","link":"kak-povysit-effektivnost-raboty-za-kompyuterom"},{"title":"Топ 5 Лайфхаков для Гугл поиска","link":"top-5-layfhakov-dlya-gugl-poiska"},{"title":"Полезные горячие клавиши для работы за ПК","link":"poleznye-goryachie-klavishi-dlya-raboty-za-pk"},{"title":"Для чего нужен Манифест","link":"dlya-chego-nuzhen-manifest"},{"title":"Для чего нужны кнопки MR MS MC M+ M- на калькуляторе?","link":"dlya-chego-nuzhny-knopki-mr-ms-mc-m+-m--na-kalkulyatore"}],"news":[{"title":"Топ 5 Лайфхаков для Гугл поиска","link":"top-5-layfhakov-dlya-gugl-poiska"},{"title":"Что такое регулярные выражения","link":"chto-takoe-regulyarnye-vyrazheniya"},{"title":"Как добавить сайт на главный экран?","link":"kak-dobavit-sayt-na-glavnyy-ekran"},{"title":"Для чего нужны кнопки MR MS MC M+ M- на калькуляторе?","link":"dlya-chego-nuzhny-knopki-mr-ms-mc-m+-m--na-kalkulyatore"},{"title":"Как повысить эффективность работы за компьютером?","link":"kak-povysit-effektivnost-raboty-za-kompyuterom"},{"title":"Для чего нужен Манифест","link":"dlya-chego-nuzhen-manifest"}],"sub":null},"lang":"ru"},"__N_SSG":true}